# ViewDisplayDepthCueing Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplayDepthCueing Members
ViewDisplayDepthCueing Class Methods Properties See Also
---
The ViewDisplayDepthCueing type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ViewDisplayDepthCueing |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetStartEndPercentages | Sets start and end percentages. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnableDepthCueing | True to enable depth cueing. False to disable it. |
| EndPercentage | The end percentage defines where depth cueing ends. Values between 0 and 100. |
| FadeTo | The fade to defines the maximum fading in per cent. Values between 0 and 100. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StartPercentage | The start percentage defines where depth cueing starts. Values between 0 and 100. |

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace